# DataFrame 병합

In [1]:
import numpy as np
import pandas as pd

### merge

In [7]:
df1 = pd.DataFrame({
    'id':[1, 2, 3, 4]
    , 'name' : ['다람쥐', '토끼', '개구리', '카피바라']
})
df2 = pd.DataFrame({
    'id':[1, 2, 3, 4]
    , 'class_no' : [4, 2, 1, 7]
})

In [9]:
 # 특정 컬럼을 기준으로 병합함. 그래서 id를 기준으로 병합을 했었음. 근데 이름이 다 다르면 오류남!
# pd.merge(df1, df2)
pd.merge(df1, df2, on='id', how='inner')

   id  name  class_no
0   1   다람쥐         4
1   2    토끼         2
2   3   개구리         1
3   4  카피바라         7

### join

### concat

### melt